// ВНИМАНИЕ! Соблюдайте форматирование кода (отступы, переносы)

// 1. Создать 10 литералов представлюящих числа (5 целых и 5 дробных)

const lit1 = 1;
const lit2 = 1000;
const lit3 = -1;
const lit4 = 96;
const lit5 = 0;
const lit6 = 3.14;
const lit7 = 0.25;
const lit8 = 1.123456;
const lit9 = 0.25;
const lit10 = 1.0;

// 2. Создать 10 строковых литералов

const lit11 = "Hello world";
const lit12 = "";
const lit13 = "Two smth\n words";
const lit14 = "abc 'abc' abc ";
const lit15 = "Playtech";
const lit16 = "1000";
const lit17 = "You are" + " " + "winner";
const lit18 = "BE GREATE";
const lit19 = `Are you ready ${lit15}`;
const lit20 = "Last one".toUpperCase();

// 3. Создать 10 объектов представляющих объекты реального мира. В каждом объекте должно быть не меньше 4 свойств.

const city = {
  name: "Kyiv",
  country: "Ukraine",
  status: "Capital",
  population: 3000000,
};

const fruit = {
  name: "Apple",
  color: "Green",
  taste: "Sweet",
  weight: 150,
};

const laptop = {
  brand: "Dell",
  model: "Inspirion 8855",
  screeSize: 15.3,
  processor: "Intel i7 7700-HQ",
};

const mobile = {
  brand: "Apple",
  model: "Iphone 14 Pro",
  color: "White",
  storage: "128Gb",
};

const pet = {
  name: "Cat",
  color: [white, black, red],
  age: 2,
  breed: null,
};

const book = {
  name: "Alice",
  authore: "Cooper T.",
  size,
};

const door = {
  isOpen: false,
  status: {
    material: ["wood", "metal", "glass"],
    id: "00231",
  },
};

var person = {
  name: "Ihor",
  surname: "Moytskyi",
  age: 37,
  isMarried: true,
};

var hair = {
  color: "black",
  height: 120,
  isHealthy: true,
  naturalColor: true,
};
// 4. Создать 10 массивов представляющих массивы некоторых значений из реальной жизни. В каждом массиве должно быть не меньше 4 элементов.

// 5. Объявить 5 переменных с произвольным именем.

// 6. Объявить еще 5 переменных и в момент объявления присвоить им значения произвольных типов данных.

// 7. Создать массив из элементов, значения которых представлены всеми изученными типами данных в JavaScript.

// 8. Создать объект из 5 свойств. Три свойства должны иметь значения простых типов данных. Два остальных свойства должны иметь значения составного (объектного) типа данных.

// 9. Написать выражения использующие все изученные арифметические операторы

// 10. Написать выражения использующие все изученные операторы сравнения

// 11. Написать выражения использующие все изученные логические операторы

// 12. Написать выражение использующее тернарный условный оператор

// 13. Написать выражения использующие все изученные операторы присваивания

// 14. Создать массив из 10 элементов (чисел) и написать выражения возвращающие значение первого, третьего, пятого и восьмого элемента

// 15. Создать массив и написать 3 выражения меняющие значения его элементов

// 16. Создать объект из 5 свойств и написать 3 выражения возвращающие значения произвольных свойств

// 17. Создать объект и написать 3 выражения меняющие значения его свойств
